# SheetDesignedBy Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..SheetDesignedBy Property
ParameterTypeId Class See Also
---
"Designed By"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId SheetDesignedBy { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property SheetDesignedBy As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ SheetDesignedBy {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace